package TwoWeek.Inyoung.March14;

public class Chapter3_01_Operator {
    /*
    연산자 종류

    산술연산자 : + - * / % << >> 
    -> 나누기 연산에서 나누는 수로 0을 사용할 수 없음.
    -> int끼리 나눈다면 결과는 int. 나머지 버려버림
    비교연산자 : > < >= <= == !=
    논리연산자 : && || ! & | ^ ~
    대입연산자 : =
    기타 : (type)   ?:   instanceof
     */

    /*
    연산자 우선순위

    1. 산술 > 비교 > 논리 > 대입. 대입 연산자는 맨 마지막!!
    2. 단항 > 이항 > 삼항
    3. 단항 연산자와 대입 연산자를 제외한 모든 연산의 진행방향은 왼 오
     */

    /*
    증감연산자
    - 전위 증감연산자 : ++i, --i
    - 후위 증감연산자 : i++, i--
     */
}
